# pandas

In [3]:
import numpy as np
import pandas as pd

### series

In [4]:
dictinary = {"vatan":29, "ahmet": 22,"veli":44}

In [5]:
pd.Series(dictinary)

vatan    29
ahmet    22
veli     44
dtype: int64

In [6]:
dictinaryage = [44,22,29]
dictinaryname = ["vatan","ahmet","veli"]

In [7]:
pd.Series(dictinaryage,dictinaryname)

vatan    44
ahmet    22
veli     29
dtype: int64

In [8]:
pd.Series(data=dictinaryage, index=dictinaryname)

vatan    44
ahmet    22
veli     29
dtype: int64

In [9]:
pd.Series(["vatan","atlas","osman"],[1,2,3])

1    vatan
2    atlas
3    osman
dtype: object

In [10]:
# pd.series (data, index)
challenge1 = pd.Series([10,5,1],["vatan","atlas","osman"])
challenge2 = pd.Series([100,52,21],["vatan","atlas","osman"])

In [11]:
challenge1

vatan    10
atlas     5
osman     1
dtype: int64

In [12]:
challenge2["atlas"]

52

In [13]:
result = challenge1 + challenge2
result

vatan    110
atlas     57
osman     22
dtype: int64

In [14]:
diffSiries1 = pd.Series([20,30,40,50],["a","b","c","d"])
diffSiries2 = pd.Series([20,30,40,50,60],["a","b","c","d","f"])

In [15]:
results = diffSiries1 + diffSiries2
results

a     40.0
b     60.0
c     80.0
d    100.0
f      NaN
dtype: float64

## DataFrame

In [16]:
data = np.random.randn(4,3)

In [17]:
data

array([[-0.51891501, -0.81832666, -0.18429049],
       [ 0.4939765 , -0.75152449, -0.7545861 ],
       [ 0.98862518, -0.38427186,  0.58487103],
       [ 0.14898409,  0.24859799, -0.45923369]])

In [18]:
dataFrame = pd.DataFrame(data)

In [19]:
dataFrame[0]

0   -0.518915
1    0.493976
2    0.988625
3    0.148984
Name: 0, dtype: float64

In [20]:
dataFrame

          0         1         2
0 -0.518915 -0.818327 -0.184290
1  0.493976 -0.751524 -0.754586
2  0.988625 -0.384272  0.584871
3  0.148984  0.248598 -0.459234

In [21]:
newDataFrame = pd.DataFrame(data, index=["vatan","zeynep","ali","asfgh"], columns=["salary","job","hours"])
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [22]:
newDataFrame[["salary"]]

          salary
vatan  -0.518915
zeynep  0.493976
ali     0.988625
asfgh   0.148984

In [23]:
newDataFrame.loc[["vatan"]]

         salary       job    hours
vatan -0.518915 -0.818327 -0.18429

In [24]:
newDataFrame.iloc[[1]]

          salary       job     hours
zeynep  0.493976 -0.751524 -0.754586

In [25]:
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [26]:
newDataFrame["salary"]

vatan    -0.518915
zeynep    0.493976
ali       0.988625
asfgh     0.148984
Name: salary, dtype: float64

In [27]:
newDataFrame["retired age"] = newDataFrame["job"] * 2

In [28]:
newDataFrame

          salary       job     hours  retired age
vatan  -0.518915 -0.818327 -0.184290    -1.636653
zeynep  0.493976 -0.751524 -0.754586    -1.503049
ali     0.988625 -0.384272  0.584871    -0.768544
asfgh   0.148984  0.248598 -0.459234     0.497196

In [29]:
newDataFrame.drop("retired age", axis=1)

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [30]:
newDataFrame.drop("asfgh")

          salary       job     hours  retired age
vatan  -0.518915 -0.818327 -0.184290    -1.636653
zeynep  0.493976 -0.751524 -0.754586    -1.503049
ali     0.988625 -0.384272  0.584871    -0.768544

In [31]:
newDataFrame

          salary       job     hours  retired age
vatan  -0.518915 -0.818327 -0.184290    -1.636653
zeynep  0.493976 -0.751524 -0.754586    -1.503049
ali     0.988625 -0.384272  0.584871    -0.768544
asfgh   0.148984  0.248598 -0.459234     0.497196

In [32]:
# delete permanintly inplace=True
newDataFrame.drop("retired age", axis=1, inplace=True)

In [33]:
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [34]:
newDataFrame.loc["vatan"]["salary"]

-0.5189150141335046

In [35]:
newDataFrame.loc["vatan","salary"]

-0.5189150141335046

In [36]:
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [37]:
booleanFrame = newDataFrame < 0

In [38]:
booleanFrame

        salary    job  hours
vatan     True   True   True
zeynep   False   True   True
ali      False   True  False
asfgh    False  False   True

In [39]:
newDataFrame[newDataFrame < 0]

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep       NaN -0.751524 -0.754586
ali          NaN -0.384272       NaN
asfgh        NaN       NaN -0.459234

In [40]:
newDataFrame[booleanFrame]

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep       NaN -0.751524 -0.754586
ali          NaN -0.384272       NaN
asfgh        NaN       NaN -0.459234

In [41]:
newDataFrame[newDataFrame["hours"] < 0]

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
asfgh   0.148984  0.248598 -0.459234

In [42]:
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [43]:
newDataFrame.reset_index()

    index    salary       job     hours
0   vatan -0.518915 -0.818327 -0.184290
1  zeynep  0.493976 -0.751524 -0.754586
2     ali  0.988625 -0.384272  0.584871
3   asfgh  0.148984  0.248598 -0.459234

In [44]:
newDataFrame

          salary       job     hours
vatan  -0.518915 -0.818327 -0.184290
zeynep  0.493976 -0.751524 -0.754586
ali     0.988625 -0.384272  0.584871
asfgh   0.148984  0.248598 -0.459234

In [45]:
newIndexList = ["vatann","zey","ali","asdsfg"]
newDataFrame["NEW INDEX"] = newIndexList
newDataFrame

          salary       job     hours NEW INDEX
vatan  -0.518915 -0.818327 -0.184290    vatann
zeynep  0.493976 -0.751524 -0.754586       zey
ali     0.988625 -0.384272  0.584871       ali
asfgh   0.148984  0.248598 -0.459234    asdsfg

In [46]:
newDataFrame.set_index("NEW INDEX")

             salary       job     hours
NEW INDEX
vatann    -0.518915 -0.818327 -0.184290
zey        0.493976 -0.751524 -0.754586
ali        0.988625 -0.384272  0.584871
asdsfg     0.148984  0.248598 -0.459234

In [47]:
newDataFrame

          salary       job     hours NEW INDEX
vatan  -0.518915 -0.818327 -0.184290    vatann
zeynep  0.493976 -0.751524 -0.754586       zey
ali     0.988625 -0.384272  0.584871       ali
asfgh   0.148984  0.248598 -0.459234    asdsfg

In [48]:
newDataFrame.set_index("NEW INDEX", inplace=True)

In [49]:
newDataFrame

             salary       job     hours
NEW INDEX
vatann    -0.518915 -0.818327 -0.184290
zey        0.493976 -0.751524 -0.754586
ali        0.988625 -0.384272  0.584871
asdsfg     0.148984  0.248598 -0.459234

In [50]:
newDataFrame.loc[["vatann"]]

             salary       job    hours
NEW INDEX
vatann    -0.518915 -0.818327 -0.18429

##### multi index

In [51]:
data = pd.read_csv("oldmatches.csv")

In [52]:
firstIndex = ["Liverpool","Aston Villa"]
secondIndex = [3,0]

In [53]:
merged = list(zip(firstIndex, secondIndex))

In [54]:
merged

[('Liverpool', 3), ('Aston Villa', 0)]

In [55]:
merged = pd.MultiIndex.from_tuples(merged)

In [56]:
merged

MultiIndex([(  'Liverpool', 3),
            ('Aston Villa', 0)],
           )

In [57]:
mergedFilmList = [[40,"a"],[20,"b"]]

In [58]:
cartoon = np.array(mergedFilmList)

In [59]:
cartoonDataFrame = pd.DataFrame(cartoon, merged)

In [60]:
cartoonDataFrame

                0  1
Liverpool   3  40  a
Aston Villa 0  20  b

In [61]:
cartoonDataFrame.index.names = ["teams","scores"]

In [62]:
cartoonDataFrame

                     0  1
teams       scores
Liverpool   3       40  a
Aston Villa 0       20  b

### missing values

In [63]:
theWeatherDataFrame = pd.read_csv("alldata.csv")
theWeatherDataFrame = pd.DataFrame(theWeatherDataFrame)

In [64]:
theWeatherDataFrame

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
1    Sunday      12.0     NaN      4
2  Saturday      25.0    23.0      6
3    Friday       NaN    56.0     34

In [65]:
theWeatherDataFrame.dropna()

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
2  Saturday      25.0    23.0      6

In [66]:
theWeatherDataFrame

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
1    Sunday      12.0     NaN      4
2  Saturday      25.0    23.0      6
3    Friday       NaN    56.0     34

In [67]:
theWeatherDataFrame.dropna(axis=1)

       days  izmir
0    Monday     34
1    Sunday      4
2  Saturday      6
3    Friday     34

In [68]:
theWeatherDataFrame.dropna(axis=1, thresh=2)
# iki tane nan varsa

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
1    Sunday      12.0     NaN      4
2  Saturday      25.0    23.0      6
3    Friday       NaN    56.0     34

In [69]:
theWeatherDataFrame.fillna(20)

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
1    Sunday      12.0    20.0      4
2  Saturday      25.0    23.0      6
3    Friday      20.0    56.0     34

In [70]:
theWeatherDataFrame = theWeatherDataFrame.fillna(20)
theWeatherDataFrame

       days  istanbul  ankara  izmir
0    Monday      22.0    23.0     34
1    Sunday      12.0    20.0      4
2  Saturday      25.0    23.0      6
3    Friday      20.0    56.0     34

### groupby

In [71]:
salary = {"department":["software","sales","products","hardware"],
         "employees":["vatan","jones","rico","walls"],
         "salary":[122,3434,4546,76676]}

In [72]:
salary = pd.DataFrame(salary)

In [73]:
salary

  department employees  salary
0   software     vatan     122
1      sales     jones    3434
2   products      rico    4546
3   hardware     walls   76676

In [75]:
groupsalary = salary.groupby("department")

In [76]:
groupsalary.mean()

            salary
department
hardware     76676
products      4546
sales         3434
software       122

In [77]:
groupsalary.count()

            employees  salary
department
hardware            1       1
products            1       1
sales               1       1
software            1       1

In [78]:
groupsalary.min()

           employees  salary
department
hardware       walls   76676
products        rico    4546
sales          jones    3434
software       vatan     122

In [79]:
groupsalary.max()

           employees  salary
department
hardware       walls   76676
products        rico    4546
sales          jones    3434
software       vatan     122

In [80]:
groupsalary.describe()

           salary
            count     mean std      min      25%      50%      75%      max
department
hardware      1.0  76676.0 NaN  76676.0  76676.0  76676.0  76676.0  76676.0
products      1.0   4546.0 NaN   4546.0   4546.0   4546.0   4546.0   4546.0
sales         1.0   3434.0 NaN   3434.0   3434.0   3434.0   3434.0   3434.0
software      1.0    122.0 NaN    122.0    122.0    122.0    122.0    122.0

In [81]:
salary.std()

salary    37035.36603
dtype: float64

In [82]:
groupsalary.describe()

           salary
            count     mean std      min      25%      50%      75%      max
department
hardware      1.0  76676.0 NaN  76676.0  76676.0  76676.0  76676.0  76676.0
products      1.0   4546.0 NaN   4546.0   4546.0   4546.0   4546.0   4546.0
sales         1.0   3434.0 NaN   3434.0   3434.0   3434.0   3434.0   3434.0
software      1.0    122.0 NaN    122.0    122.0    122.0    122.0    122.0

## concatination

In [84]:
dataa = pd.read_csv("ranking.csv")
dataa

    Position            team  Point  Unnamed: 3
0          1       Liverpool   2010         NaN
1          2        Man City   1900         NaN
2          3         Chelsea   1800         NaN
3          4      Man United   1798         NaN
4          5         Arsenal   1788         NaN
5          6          Wolves   1788         NaN
6          7       Tottenham   1787         NaN
7          8       Leicester   1786         NaN
8          9         Everton   1785         NaN
9         10        Brighton   1784         NaN
10        11           Leeds   1783         NaN
11        12   Sheffield Utd   1781         NaN
12        13       Newcastle   1768         NaN
13        14       West Brom   1758         NaN
14        15  Crystal Palace   1738         NaN
15        16        West Ham   1728         NaN
16        17         Cardiff   1718         NaN
17        18     Southampton   1718         NaN
18        19     Aston Villa   1700         NaN
19        20          Fulham   1699         NaN
20        21         Burnley   1688         NaN
21        22      Stoke City   1677         NaN
22        23         Norwich   1669         NaN
23        24         Watford   1666         NaN
24        25       Wimbledon   1400         NaN
25        26     Bournemouth   1423         NaN
26        27       Blackburn   1412         NaN
27        28      Sunderland   1400         NaN
28        29             QPR   1399         NaN
29        30           Wigan   1389         NaN
30        31         Swansea   1367         NaN
31        32         Swindon   1323         NaN
32        33          Bolton   1300         NaN
33        34       Blackpool   1278         NaN
34        35      Birmingham   1234         NaN
35        36      Portsmouth   1134         NaN
36        37            Hull   1123         NaN
37        38           Derby   1114         NaN
38        39   Middlesbrough   1112         NaN
39        40         Reading   1100         NaN
40        41        Charlton   1008         NaN
41        42         Ipswich   1005         NaN
42        43   Not'tm Forest   1004         NaN
43        44        Coventry   1003         NaN
44        45          Oldham   1002         NaN
45        46        Barnsley   1000         NaN
46        47        Bradford    999         NaN

In [85]:
dataa = dataa.dropna(axis=1)

In [87]:
dataa

    Position            team  Point
0          1       Liverpool   2010
1          2        Man City   1900
2          3         Chelsea   1800
3          4      Man United   1798
4          5         Arsenal   1788
5          6          Wolves   1788
6          7       Tottenham   1787
7          8       Leicester   1786
8          9         Everton   1785
9         10        Brighton   1784
10        11           Leeds   1783
11        12   Sheffield Utd   1781
12        13       Newcastle   1768
13        14       West Brom   1758
14        15  Crystal Palace   1738
15        16        West Ham   1728
16        17         Cardiff   1718
17        18     Southampton   1718
18        19     Aston Villa   1700
19        20          Fulham   1699
20        21         Burnley   1688
21        22      Stoke City   1677
22        23         Norwich   1669
23        24         Watford   1666
24        25       Wimbledon   1400
25        26     Bournemouth   1423
26        27       Blackburn   1412
27        28      Sunderland   1400
28        29             QPR   1399
29        30           Wigan   1389
30        31         Swansea   1367
31        32         Swindon   1323
32        33          Bolton   1300
33        34       Blackpool   1278
34        35      Birmingham   1234
35        36      Portsmouth   1134
36        37            Hull   1123
37        38           Derby   1114
38        39   Middlesbrough   1112
39        40         Reading   1100
40        41        Charlton   1008
41        42         Ipswich   1005
42        43   Not'tm Forest   1004
43        44        Coventry   1003
44        45          Oldham   1002
45        46        Barnsley   1000
46        47        Bradford    999

In [88]:
# alt alta istiyorsan axis=0 yeni column ise axis=1
# **** but all columns must be same ***
# concatenation = pd.concat([dataframe1,dataframe2,dataframe3], axis=0)

## merge

In [90]:
# if all dataframe columns is different but one or two of them is same
# we can use merge
#pd.merge([dataframe1,dataframe2, on="Home Team"])

In [91]:
salary

  department employees  salary
0   software     vatan     122
1      sales     jones    3434
2   products      rico    4546
3   hardware     walls   76676

In [93]:
salary["department"].unique()
# unique if there are same department

array(['software', 'sales', 'products', 'hardware'], dtype=object)

In [95]:
salary["department"].nunique()

4

In [98]:
salary["department"].value_counts()

products    1
hardware    1
software    1
sales       1
Name: department, dtype: int64

In [96]:
def brutte(salary):
    return salary * 23

In [97]:
# to apply
salary["salary"].apply(brutte)

0       2806
1      78982
2     104558
3    1763548
Name: salary, dtype: int64

In [150]:
salary.isnull()

   department  employees  salary
0       False      False   False
1       False      False   False
2       False      False   False
3       False      False   False

In [151]:
newData = salary

In [152]:
newData

  department employees  salary
0   software     vatan     122
1      sales     jones    3434
2   products      rico    4546
3   hardware     walls   76676

In [153]:
newData = newData.append({"department": "software", "employees":"anelka", "salary":99999}, ignore_index=True)
# newData = newData.drop(newData[newData["employees"]=="anelka"].index)
newData

  department employees  salary
0   software     vatan     122
1      sales     jones    3434
2   products      rico    4546
3   hardware     walls   76676
4   software    anelka   99999

In [154]:
newguy = {"department":"hardware", "employees":"rich","salary":4567}
newData = newData.append(newguy, ignore_index=True)

In [155]:
newData.pivot_table(values = "salary" , index = ["department","employees"])

                      salary
department employees
hardware   rich         4567
           walls       76676
products   rico         4546
sales      jones        3434
software   anelka      99999
           vatan         122

In [158]:
dataFrame = pd.read_excel("kitap1.xlsx")

In [159]:
dataFrame

    Position        team   Point
0          1   Liverpool  2010.0
1          2    Man City  1900.0
2          3     Chelsea  1800.0
3          4  Man United  1798.0
4          5     Arsenal  1788.0
5          6      Wolves  1788.0
6          7   Tottenham     NaN
7          8   Leicester  1786.0
8          9     Everton  1785.0
9         10         NaN  1784.0
10        11       Leeds  1783.0

In [162]:
fulldataframe = dataFrame.dropna()
fulldataframe

    Position        team   Point
0          1   Liverpool  2010.0
1          2    Man City  1900.0
2          3     Chelsea  1800.0
3          4  Man United  1798.0
4          5     Arsenal  1788.0
5          6      Wolves  1788.0
7          8   Leicester  1786.0
8          9     Everton  1785.0
10        11       Leeds  1783.0

In [163]:
fulldataframe.to_excel("newkitab1.xlsx")

In [164]:
fulldataframe

    Position        team   Point
0          1   Liverpool  2010.0
1          2    Man City  1900.0
2          3     Chelsea  1800.0
3          4  Man United  1798.0
4          5     Arsenal  1788.0
5          6      Wolves  1788.0
7          8   Leicester  1786.0
8          9     Everton  1785.0
10        11       Leeds  1783.0

In [165]:
### read csv for ,
## to csv